In [93]:
import pandas as pd
import numpy as np

In [94]:
data = {
    "Name": ["Tanmay", "Vivek", "Rohan", "Raghav", "Rounak", "Aaditya"],
    "State": ["UP", "RJ", "RJ", "HR", "BR", "RJ"]
}

In [95]:
df = pd.DataFrame(data)

In [96]:
df

      Name State
0   Tanmay    UP
1    Vivek    RJ
2    Rohan    RJ
3   Raghav    HR
4   Rounak    BR
5  Aaditya    RJ

In [97]:
states = df["State"].unique()
print(states)
states = list(states)

['UP' 'RJ' 'HR' 'BR']

In [100]:
for state in states:
    other_states = [s for s in states if s != state]
    map = {}
    st = {state: 1}

    for i in range(3):
        map.update({other_states[i]: 0})
    
    map.update(st)

    df[state + "_OHE"] = df["State"].map(map)

In [101]:
df

      Name State  UP_OHE  RJ_OHE  HR_OHE  BR_OHE
0   Tanmay    UP       1       0       0       0
1    Vivek    RJ       0       1       0       0
2    Rohan    RJ       0       1       0       0
3   Raghav    HR       0       0       1       0
4   Rounak    BR       0       0       0       1
5  Aaditya    RJ       0       1       0       0

In [ ]:
#2nd method bhi mila hai ek...

df = pd.DataFrame(data)

In [109]:
df

      Name State
0   Tanmay    UP
1    Vivek    RJ
2    Rohan    RJ
3   Raghav    HR
4   Rounak    BR
5  Aaditya    RJ

In [110]:
states = df["State"].unique()

In [120]:
for state in states:
    map = {state: 1}
    df[state + "_flag"] = df["State"].map(map).fillna(0).astype(int)

In [121]:
df

      Name State  UP_flag  RJ_flag  HR_flag  BR_flag
0   Tanmay    UP        1        0        0        0
1    Vivek    RJ        0        1        0        0
2    Rohan    RJ        0        1        0        0
3   Raghav    HR        0        0        1        0
4   Rounak    BR        0        0        0        1
5  Aaditya    RJ        0        1        0        0